export const EVASION_OPTIONS = [
  "0", "3+", "3-", "6", "6-10", "10-15",
]

export const BODY_OPTIONS = [
  "最速", "準速", "中間", "準大", "最大",
]

export const COLOR_OPTIONS: Record<string, string[]> = {
  '黒色系': ["黒", "薄黒", "濃黒"],
  '赤色系': ["赤", "薄赤", "濃赤"],
  '青色系': ["青", "薄青", "濃青"],
  '黄色系': ["黄", "薄黄", "濃黄"],
  '橙色系': ["橙", "薄橙", "濃橙"],
  '緑色系': ["緑", "薄緑", "濃緑"],
  '水色系': ["水", "薄水", "濃水"],
  '紫色系': ["紫", "薄紫", "濃紫"],
  '白色系': ["白", "薄白", "濃白"],
}

export const HEAD_OPTIONS = [
  "よこまる", "かどまる", "まる", "さんかく", "しかく", "たてまる",
]

export const ANTENNA_OPTIONS: Record<string, string[]> = {
  'アンテナなし': ['アンテナなし'],
  '攻撃（火）': ['ひのたま', 'ばくはつ'],
  '攻撃（氷）': ['とがったこおり', 'ロックアイス'],
  '攻撃（風）': ['つむじかぜ', 'ビルかぜ'],
  '攻撃（土）': ['らくせき', 'いしつぶて'],
  '攻撃（電気）': ['せいでんき', 'いなづま'],
  '攻撃（水）': ['みずでっぽう', 'バケツのみず'],
  '攻撃（闇）': ['おどかす', 'ダークボール'],
  '攻撃（光）': ['よわいこうせん', 'スポットライト'],
  '攻撃（その他）': ['ノックダウン'],
  '回復': ['ちょっとかいふく'],
  '治療': [
    'ちょっとふっかつ',
    'ぜんぶなおす',
    'げどく',
    'しびれとる',
    'めざめる',
    'ぞくせいなおす'
  ],
  '増強': [
    'すこしはやくなれ',
    'すこしつよくなれ',
    'すこしかたくなれ',
    'すこしかわしやすい',
    'すこしこうふん',
    'すこしむてき',
    'たくわえる',
  ],
  '補助': [
    'すこしねむらせる',
    'すこししびれさせる',
    'すこしおそくなれ',
    'すこしやわくなれ',
    'すこしよわくなれ',
    'すこしめかくし',
    'どくになれ',
    'みんなすこしよけにくい',
  ],
  'お得': ['ちょっとあしもとガード'],
}

export const FEATURE_OPTIONS = [
  "なし", "親子", "双子",
]

export const BODY_TABLE_DATA: Record<
  string,
  {
    category: string
    antenna: string
    hp: number[]
  }[]
> = {
  '0': [
    {
      category: 'なし',
      antenna: 'アンテナなし',
      hp: [40, 37, 34, 32, 29],
    },
    {
      category: '攻撃',
      antenna: '単体属性攻撃',
      hp: [33, 31, 29, 27, 24],
    },
    {
      category: '〃',
      antenna: '３体属性攻撃',
      hp: [35, 33, 30, 28, 26],
    },
    {
      category: '〃',
      antenna: 'ノックダウン',
      hp: [38, 36, 33, 31, 28],
    },
    {
      category: '回復',
      antenna: 'ちょっとかいふく',
      hp: [41, 39, 36, 33, 31],
    },
    {
      category: '治療',
      antenna: 'ちょっとふっかつ',
      hp: [42, 40, 37, 35, 32],
    },
    {
      category: '〃',
      antenna: 'ぜんぶなおす',
      hp: [42, 40, 37, 35, 32],
    },
    {
      category: '〃',
      antenna: 'げどく',
      hp: [42, 39, 37, 34, 32],
    },
    {
      category: '〃',
      antenna: 'しびれとる',
      hp: [43, 41, 38, 36, 33],
    },
    {
      category: '〃',
      antenna: 'めざめる',
      hp: [43, 40, 38, 35, 33],
    },
    {
      category: '〃',
      antenna: 'ぞくせいなおす',
      hp: [42, 40, 37, 34, 32],
    },
    {
      category: '増強',
      antenna: 'すこしこうふん',
      hp: [37, 35, 32, 30, 27],
    },
    {
      category: '〃',
      antenna: 'すこしむてき',
      hp: [42, 40, 37, 35, 32],
    },
    {
      category: '〃',
      antenna: 'たくわえる',
      hp: [42, 39, 37, 35, 32],
    },
    {
      category: '〃',
      antenna: 'その他単体増強系',
      hp: [36, 34, 32, 30, 27],
    },
    {
      category: '補助',
      antenna: '補助系',
      hp: [37, 35, 32, 30, 27],
    },
    {
      category: 'お得',
      antenna: 'ちょっとあしもとガード',
      hp: [35, 32, 30, 27, 25],
    },
  ],

  '3+': [
    {
      category: 'なし',
      antenna: 'アンテナなし',
      hp: [37, 34, 32, 29, 26],
    },
    {
      category: '攻撃',
      antenna: '単体属性攻撃',
      hp: [31, 29, 27, 24, 22],
    },
    {
      category: '〃',
      antenna: '３体属性攻撃',
      hp: [33, 30, 28, 26, 23],
    },
    {
      category: '〃',
      antenna: 'ノックダウン',
      hp: [36, 33, 31, 28, 26],
    },
    {
      category: '回復',
      antenna: 'ちょっとかいふく',
      hp: [39, 36, 33, 31, 28],
    },
    {
      category: '治療',
      antenna: 'ちょっとふっかつ',
      hp: [40, 37, 35, 32, 30],
    },
    {
      category: '〃',
      antenna: 'ぜんぶなおす',
      hp: [40, 37, 35, 32, 30],
    },
    {
      category: '〃',
      antenna: 'げどく',
      hp: [39, 37, 34, 32, 29],
    },
    {
      category: '〃',
      antenna: 'しびれとる',
      hp: [41, 38, 36, 33, 31],
    },
    {
      category: '〃',
      antenna: 'めざめる',
      hp: [40, 38, 35, 33, 30],
    },
    {
      category: '〃',
      antenna: 'ぞくせいなおす',
      hp: [40, 37, 34, 32, 29],
    },
    {
      category: '増強',
      antenna: 'すこしこうふん',
      hp: [35, 32, 30, 27, 25],
    },
    {
      category: '〃',
      antenna: 'すこしむてき',
      hp: [40, 37, 35, 32, 30],
    },
    {
      category: '〃',
      antenna: 'たくわえる',
      hp: [39, 37, 35, 32, 30],
    },
    {
      category: '〃',
      antenna: 'その他単体増強系',
      hp: [34, 32, 30, 27, 25],
    },
    {
      category: '補助',
      antenna: '補助系',
      hp: [35, 32, 30, 27, 25],
    },
    {
      category: 'お得',
      antenna: 'ちょっとあしもとガード',
      hp: [32, 30, 27, 25, 22],
    },
  ],

  '3-': [
    {
      category: 'なし',
      antenna: 'アンテナなし',
      hp: [34, 32, 29, 26, 24],
    },
    {
      category: '攻撃',
      antenna: '単体属性攻撃',
      hp: [29, 27, 24, 22, 20],
    },
    {
      category: '〃',
      antenna: '３体属性攻撃',
      hp: [30, 28, 26, 23, 21],
    },
    {
      category: '〃',
      antenna: 'ノックダウン',
      hp: [33, 31, 28, 26, 23],
    },
    {
      category: '回復',
      antenna: 'ちょっとかいふく',
      hp: [36, 33, 31, 28, 26],
    },
    {
      category: '治療',
      antenna: 'ちょっとふっかつ',
      hp: [37, 35, 32, 30, 27],
    },
    {
      category: '〃',
      antenna: 'ぜんぶなおす',
      hp: [37, 35, 32, 30, 27],
    },
    {
      category: '〃',
      antenna: 'げどく',
      hp: [37, 34, 32, 29, 26],
    },
    {
      category: '〃',
      antenna: 'しびれとる',
      hp: [38, 36, 33, 31, 28],
    },
    {
      category: '〃',
      antenna: 'めざめる',
      hp: [38, 35, 33, 30, 27],
    },
    {
      category: '〃',
      antenna: 'ぞくせいなおす',
      hp: [37, 34, 32, 29, 27],
    },
    {
      category: '増強',
      antenna: 'すこしこうふん',
      hp: [32, 30, 27, 25, 22],
    },
    {
      category: '〃',
      antenna: 'すこしむてき',
      hp: [37, 35, 32, 30, 27],
    },
    {
      category: '〃',
      antenna: 'たくわえる',
      hp: [37, 35, 32, 30, 27],
    },
    {
      category: '〃',
      antenna: 'その他単体増強系',
      hp: [32, 30, 27, 25, 23],
    },
    {
      category: '補助',
      antenna: '補助系',
      hp: [32, 30, 27, 25, 22],
    },
    {
      category: 'お得',
      antenna: 'ちょっとあしもとガード',
      hp: [30, 27, 25, 22, 20],
    },
  ],

  '6': [
    {
      category: 'なし',
      antenna: 'アンテナなし',
      hp: [32, 29, 26, 26, 26,],
    },
    {
      category: '攻撃',
      antenna: '単体属性攻撃',
      hp: [27, 24, 22, 22, 22],
    },
    {
      category: '〃',
      antenna: '３体属性攻撃',
      hp: [28, 26, 23, 23, 23],
    },
    {
      category: '〃',
      antenna: 'ノックダウン',
      hp: [31, 28, 26, 26, 26],
    },
    {
      category: '回復',
      antenna: 'ちょっとかいふく',
      hp: [33, 31, 28, 28, 28],
    },
    {
      category: '治療',
      antenna: 'ちょっとふっかつ',
      hp: [35, 32, 30, 30, 30],
    },
    {
      category: '〃',
      antenna: 'ぜんぶなおす',
      hp: [35, 32, 30, 30, 30],
    },
    {
      category: '〃',
      antenna: 'げどく',
      hp: [34, 32, 29, 29, 29],
    },
    {
      category: '〃',
      antenna: 'しびれとる',
      hp: [36, 33, 31, 31, 31],
    },
    {
      category: '〃',
      antenna: 'めざめる',
      hp: [35, 33, 30, 30, 30],
    },
    {
      category: '〃',
      antenna: 'ぞくせいなおす',
      hp: [34, 32, 29, 29, 29],
    },
    {
      category: '増強',
      antenna: 'すこしこうふん',
      hp: [30, 27, 25, 25, 25],
    },
    {
      category: '〃',
      antenna: 'すこしむてき',
      hp: [35, 32, 30, 30, 30],
    },
    {
      category: '〃',
      antenna: 'たくわえる',
      hp: [35, 32, 30, 30, 30],
    },
    {
      category: '〃',
      antenna: 'その他単体増強系',
      hp: [27, 25, 23, 23, 23],
    },
    {
      category: '補助',
      antenna: '補助系',
      hp: [30, 27, 25, 25, 25],
    },
    {
      category: 'お得',
      antenna: 'ちょっとあしもとガード',
      hp: [27, 25, 22, 22, 22],
    },
  ],

  '6-10': [
    {
      category: 'なし',
      antenna: 'アンテナなし',
      hp: [29, 26, 24, 21, 18],
    },
    {
      category: '攻撃',
      antenna: '単体属性攻撃',
      hp: [24, 22, 20, 18, 15],
    },
    {
      category: '〃',
      antenna: '３体属性攻撃',
      hp: [26, 23, 21, 19, 16],
    },
    {
      category: '〃',
      antenna: 'ノックダウン',
      hp: [28, 26, 23, 21, 18],
    },
    {
      category: '回復',
      antenna: 'ちょっとかいふく',
      hp: [31, 28, 26, 23, 21],
    },
    {
      category: '治療',
      antenna: 'ちょっとふっかつ',
      hp: [32, 30, 27, 25, 22],
    },
    {
      category: '〃',
      antenna: 'ぜんぶなおす',
      hp: [32, 30, 27, 25, 22],
    },
    {
      category: '〃',
      antenna: 'げどく',
      hp: [32, 29, 26, 24, 21],
    },
    {
      category: '〃',
      antenna: 'しびれとる',
      hp: [33, 31, 28, 26, 23],
    },
    {
      category: '〃',
      antenna: 'めざめる',
      hp: [33, 30, 27, 25, 22],
    },
    {
      category: '〃',
      antenna: 'ぞくせいなおす',
      hp: [32, 29, 27, 24, 22],
    },
    {
      category: '増強',
      antenna: 'すこしこうふん',
      hp: [27, 25, 22, 20, 17],
    },
    {
      category: '〃',
      antenna: 'すこしむてき',
      hp: [32, 30, 27, 25, 22],
    },
    {
      category: '〃',
      antenna: 'たくわえる',
      hp: [32, 30, 27, 25, 22],
    },
    {
      category: '〃',
      antenna: 'その他単体増強系',
      hp: [25, 23, 21, 21, 18],
    },
    {
      category: '補助',
      antenna: '補助系',
      hp: [27, 25, 22, 20, 17],
    },
    {
      category: 'お得',
      antenna: 'ちょっとあしもとガード',
      hp: [25, 22, 20, 17, 15],
    },
  ],

  '10-15': [
    {
      category: 'なし',
      antenna: 'アンテナなし',
      hp: [26, 24, 21, 18, 16],
    },
    {
      category: '攻撃',
      antenna: '単体属性攻撃',
      hp: [22, 20, 18, 15, 13],
    },
    {
      category: '〃',
      antenna: '３体属性攻撃',
      hp: [23, 21, 19, 16, 14],
    },
    {
      category: '〃',
      antenna: 'ノックダウン',
      hp: [26, 23, 21, 18, 16],
    },
    {
      category: '回復',
      antenna: 'ちょっとかいふく',
      hp: [28, 26, 23, 21, 18],
    },
    {
      category: '治療',
      antenna: 'ちょっとふっかつ',
      hp: [30, 27, 25, 22, 20],
    },
    {
      category: '〃',
      antenna: 'ぜんぶなおす',
      hp: [30, 27, 25, 22, 20],
    },
    {
      category: '〃',
      antenna: 'げどく',
      hp: [29, 26, 24, 21, 19],
    },
    {
      category: '〃',
      antenna: 'しびれとる',
      hp: [31, 28, 26, 23, 21],
    },
    {
      category: '〃',
      antenna: 'めざめる',
      hp: [30, 27, 25, 22, 20],
    },
    {
      category: '〃',
      antenna: 'ぞくせいなおす',
      hp: [29, 27, 24, 22, 19],
    },
    {
      category: '増強',
      antenna: 'すこしこうふん',
      hp: [25, 22, 20, 17, 15],
    },
    {
      category: '〃',
      antenna: 'すこしむてき',
      hp: [30, 27, 25, 22, 20],
    },
    {
      category: '〃',
      antenna: 'たくわえる',
      hp: [30, 27, 25, 22, 20],
    },
    {
      category: '〃',
      antenna: 'その他単体増強系',
      hp: [23, 21, 21, 18, 16],
    },
    {
      category: '補助',
      antenna: '補助系',
      hp: [25, 22, 20, 17, 15],
    },
    {
      category: 'お得',
      antenna: 'ちょっとあしもとガード',
      hp: [22, 20, 17, 15, 12],
    },
  ],
}

export const BODY_TABLE_EXCEPTIONS: Record<string, string> = {
  '単体属性攻撃':
    '該当アンテナ：ひのたま とがったこおり つむじかぜ らくせき せいでんき みずでっぽう おどかす よわいこうせん\n「ひのたま」「みずでっぽう」はHP+1\n「つむじかぜ」「よわいこうせん」は回避率+1',

  '３体属性攻撃':
    '該当アンテナ：ばくはつ ロックアイス ビルかぜ いしつぶて いなづま バケツのみず ダークボール スポットライト\n「ばくはつ」「バケツのみず」はHP+1\n「ビルかぜ」「スポットライト」は回避率+1',

  'ノックダウン':
    '回避率+1',

  'その他単体増強系':
    '該当アンテナ：すこしはやくなれ すこしつよくなれ すこしかたくなれ すこしかわしやすい\n「すこしかわしやすい」は回避率+2',

  '補助系':
    '該当アンテナ：すこしねむらせる すこししびれさせる すこしおそくなれ すこしやわくなれ すこしめかくし どくになれ みんなすこしよけにくい\n「みんなすこしよけにくい」は回避率+4',

  'ちょっとあしもとガード':
    '回避率+1',
}